Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/RTC_old/RTC_old.tmx
Source language: en_us
Languages: de_de

source: CLAIMS
de_de: PATENTANSPRÜCHE

source: 1. A federated display system, comprising:
de_de: 1. Föderiertes Anzeigesystem, umfassend:

source: a plurality of head down displays, HDD (102,104,106,108), including a first HDD and at least one second HDD;
de_de: eine Vielzahl von Head-Down-Displays, HDD (102, 104, 106, 108), einschließlich einer ersten HDD und mindestens einer zweiten HDD;

source: and
de_de: und

source: at least two display processing computers, DPC (110,112), each DPC comprising:
de_de: mindestens zwei Anzeigeverarbeitungscomputer, DPC (110, 112), jeder DPC umfassend:

source: a plurality of independent nodes (114,116) including a first node and at least one second node, each independent node including one or more processors comprising one or more of:
de_de: eine Vielzahl von unabhängigen Knoten (114, 116), einschließlich eines ersten Knotens und mindestens eines zweiten Knotens, wobei jeder unabhängige Knoten einen oder mehrere Prozessoren aufweist, umfassend eines oder mehrere der folgenden Elemente:

source: a processing controller (122);
de_de: eine Prozesssteuerung (122);

source: a graphics generator (124,126) coupled to the processing controller, the graphics generator configured to generate at least one image stream based on external input;
de_de: einen mit dem Verarbeitungscontroller verbundenen Grafikgenerator (124, 126), wobei der Grafikgenerator konfiguriert ist, um auf der Grundlage externer Eingaben mindestens einen Bildstrom zu erzeugen;

source: input/output (I/O) control logic (128,130) coupled to the graphics generator and to an external source, the I/O control logic configured to receive the external input from the external source;
de_de: eine Eingabe-/Ausgabe(E/A)-Steuerlogik (128, 130), die mit dem Grafikgenerator und einer externen Quelle gekoppelt ist, wobei die E/A-Steuerlogik konfiguriert ist, um die externe Eingabe von der externen Quelle zu empfangen;

source: and characterized by:
de_de: und gekennzeichnet durch:

source: at least one mezzanine control plane (118) communicatively coupled to each independent node of the plurality of independent nodes, the mezzanine control plane comprising:
de_de: mindestens eine Mezzanine-Steuerebene (118), die kommunikativ mit jedem unabhängigen Knoten der Vielzahl von unabhängigen Knoten gekoppelt ist, die Mezzanine-Steuerebene umfassend:

source: a plurality of optical channels (140) including at least a first optical channel optically coupling the mezzanine control plane to the first HDD and at least one second optical channel optically coupling the mezzanine control plane to the second HDD;
de_de: eine Vielzahl von optischen Kanälen (140), einschließlich mindestens eines ersten optischen Kanals, der die Mezzanine-Steuerebene optisch mit der ersten HDD verbindet, und mindestens eines zweiten optischen Kanals, der die Mezzanine-Steuerebene optisch mit der zweiten HDD verbindet;

source: a switching fabric configured to route graphical output from the graphics generator of one of the first node or the at least one second node to the first optical channel and the at least one second optical channel, the switching fabric controllable by either the first node or the at least one second node and including at least one master selector (204) configured to designate one of the first node or the second node as a master node.
de_de: eine Schaltstruktur, die konfiguriert ist, um grafische Ausgaben von dem Grafikgenerator eines der ersten Knoten oder des mindestens einen zweiten Knotens an den ersten optischen Kanal und den mindestens einen zweiten optischen Kanal weiterleitet, wobei die Schaltstruktur entweder von dem ersten Knoten oder von dem mindestens einen zweiten Knoten steuerbar ist und mindestens einen Master-Selektor (204) aufweist, der konfiguriert ist, um einen der ersten Knoten oder den zweiten Knoten als Master-Knoten zu bezeichnen.

source: 2. The federated display system of claim 1, wherein the plurality of optical channels includes at least one optical data link, ODL (212).
de_de: 2. Föderiertes Anzeigesystem nach Anspruch 1, wobei die Vielzahl von optischen Kanälen mindestens eine optische Datenverbindung, ODL (212), aufweist.

source: 3. The federated display system of claim 1 or 2, wherein the plurality of optical channels includes at least one ARINC 818 compatible optical channel (212).
de_de: 3. Föderiertes Anzeigesystem nach Anspruch 1 oder 2, wobei die Vielzahl von optischen Kanälen mindestens einen ARINC 818-kompatiblen optischen Kanal (212) aufweist.

source: 4. The federated display system of any preceding claim, wherein the switching fabric is controllable by at least one of:
de_de: 4. Föderiertes Anzeigesystem nach einem der vorhergehenden Ansprüche, wobei die Schaltstruktur durch mindestens eines der folgenden Elemente steuerbar ist:

source: a first processing controller (120) of the first node;
de_de: eine erste Prozesssteuerung (120) des ersten Knotens;

source: a first graphics generator (124) of the first node;
de_de: einen ersten Grafikgenerator (124) des ersten Knotens;

source: a second processing controller (122) of the at least one second node;
de_de: eine zweite Prozesssteuerung (122) des mindestens einen zweiten Knotens;

source: a second graphics generator (126) of the at least one second node.
de_de: einen zweiten Grafikgenerator (126) des mindestens einen zweiten Knotens.

source: 5. The federated display system of claim 4, wherein the switching fabric is configured to direct external input data to at least one of the first graphics generator and the second graphics generator.
de_de: 5. Föderiertes Anzeigesystem nach Anspruch 4, wobei die Schaltstruktur konfiguriert ist, um externe Eingabedaten an mindestens einen der ersten und den zweiten Grafikgeneratoren weiterzuleiten.

source: 6. The federated display system of any preceding claim, wherein the external source includes at least one of an aircraft-based sensor, a camera, an image sensor, a navigational sensor, and a communications link.
de_de: 6. Föderiertes Anzeigesystem nach einem der vorhergehenden Ansprüche, wobei die externe Quelle mindestens einen flugzeugbasierten Sensor, eine Kamera, einen Bildsensor, einen Navigationssensor und eine Kommunikationsverbindung aufweist.

source: 7. The federated display system of any preceding claim, wherein the display system is embodied aboard a mobile platform.
de_de: 7. Föderiertes Anzeigesystem nach einem der vorhergehenden Ansprüche, wobei das Anzeigesystem an Bord einer mobilen Plattform verkörpert ist.

source: CLAIMS1.
de_de: PATENTANSPRÜCHE1.

source: A sensor array (50') having a lattice topology, comprising:
de_de: Ein Sensorarray (50') mit einer Gittertopologie, umfassend:

source: a plurality of interconnects (52, 54) comprising an electrically-conductive layer sandwiched between two dielectric layers, the plurality of interconnects (52, 54) defining:
de_de: eine Vielzahl von Zwischenverbindungen (52, 54), die eine elektrisch leitende Schicht umfassen, die zwischen zwei dielektrischen Schichten angeordnet ist, wobei die Vielzahl von Zwischenverbindungen (52, 54) definiert:

source: a plurality of first-axis interconnects (52);
de_de: eine Vielzahl von Erstachsen-Zwischenverbindungen (52);

source: a plurality of second-axis interconnects (54); and
de_de: eine Vielzahl von Zweitachsen-Zwischenverbindungen (54); und

source: a plurality of interconnect junctions;
de_de: eine Vielzahl von Zwischenverbindungsstellen;

source: a plurality of sensor nodes (190), each disposed on an associated interconnect junction defining an associated first-axis line and second-axis line;
de_de: eine Vielzahl von Sensorknoten (190), die jeweils an einer zugehörigen Zwischenverbindungsstelle angeordnet sind, die eine zugehörige Erstachsenleitung und eine Zweitachsenleitung definiert;

source: a plurality of sensors, each disposed on an associated sensor node (190);
de_de: eine Vielzahl von Sensoren, die jeweils auf einem zugehörigen Sensorknoten (190) angeordnet sind;

source: a primary first-axis interconnect interface (56), electrically connected to the plurality of first-axis interconnects (52); and
de_de: eine primäre Erstachsen-Zwischenverbindungsschnittstelle (56), die elektrisch mit der Vielzahl von Erstachsen-Zwischenverbindungen (52) verbunden ist; und

source: a primary second-axis interconnect interface (58), electrically connected to the plurality of second-axis interconnects (54),
de_de: eine primäre Zweitachsen-Zwischenverbindungsschnittstelle (58), die elektrisch mit der Vielzahl von Zweitachsen-Zwischenverbindungen (54) verbunden ist,

source: characterized in that the plurality of interconnects further defines:
de_de: dadurch gekennzeichnet, dass die Vielzahl von Zwischenverbindungen ferner definiert:

source: a secondary first-axis interconnect interface (56'), electrically connected to the plurality of first-axis interconnects (52); and
de_de: eine sekundäre Erstachsen-Zwischenverbindungsschnittstelle (56'), die elektrisch mit der Vielzahl von Erstachsen-Zwischenverbindungen (52) verbunden ist; und

source: a secondary second-axis interconnect interface (58'), electrically connected to the plurality of second-axis interconnects (54),
de_de: eine sekundäre Zweitachsen-Zwischenverbindungsschnittstelle (58'), die elektrisch mit der Vielzahl von Zweitachsen-Zwischenverbindungen (54) verbunden ist,

source: wherein each of the plurality of sensor nodes (190) comprises:
de_de: wobei jeder der Vielzahl von Sensorknoten (190) umfasst:

source: a first electrode (64, 102, 142), electrically connected to an associated first-axis line;
de_de: eine erste Elektrode (64, 102, 142), die elektrisch mit einer zugehörigen Erstachsenleitung verbunden ist;

source: a second electrode (68, 102', 142'), electrically connected to an associated second-axis line; and
de_de: eine zweite Elektrode (68, 102', 142'), die elektrisch mit einer zugehörigen Zweitachsenleitung verbunden ist; und

source: a bypass bridge (72, 108, 148), electrically isolating the associated second-axis line from the associated first-axis line,
de_de: eine Bypass-Brücke (72, 108, 148), die die zugehörige Zweitachsenleitung von der zugehörigen Erstachsenleitung elektrisch isoliert,

source: wherein the primary first-axis interconnect interface (56) and the secondary first-axis interconnect interface (56) are configured to enable one or more of the plurality of first-axis interconnects (52), and the primary second-axis interconnect interface (58) and the secondary second-axis interconnect interface (58') are configured to enable one or more of the plurality of second-axis interconnects (54), thereby interrogating the sensor nodes (190) associated with the one or more enabled first-axis interconnects (52) and the one or more enabled second-axis interconnects (54),
de_de: wobei die primäre Erstachsen-Zwischenverbindungsschnittstelle (56) und die sekundäre Erstachsen-Zwischenverbindungsschnittstelle (56) derart ausgelegt sind, dass sie eine oder mehrere der Vielzahl von Erstachsen-Zwischenverbindungen (52) aktivieren, und die primäre Zweitachsen-Zwischenverbindungsschnittstelle (58) und die sekundäre Zweitachsen-Zwischenverbindungsschnittstelle (58') der zweiten Achse derart ausgelegt sind, dass sie eine oder mehrere der Vielzahl von Zweitachsen-Zwischenverbindungen (54) aktivieren, wodurch die Sensorknoten (190) abgefragt werden, die der einen oder den mehreren aktivierten Erstachsen-Zwischenverbindungen (52) und der einen oder den mehreren aktivierten Zweitachsen-Zwischenverbindungen (54) zugehörig sind,

source: wherein the sensor array (50') is configured such that two of the plurality of sensors are interrogated at the same time by simultaneously:
de_de: wobei das Sensorarray (50') derart ausgelegt ist, dass zwei der Vielzahl von Sensoren gleichzeitig abgefragt werden durch gleichzeitiges:

source: enabling one of the plurality of first-axis interconnects (52) by the primary first-axis interconnect interface (56);
de_de: Aktivieren einer der Vielzahl von Erstachsen-Zwischenverbindungen (52) durch die primäre Erstachsen-Zwischenverbindungsschnittstelle (56);

source: enabling one of the plurality of second-axis interconnects (54) by the primary second-axis interconnect interface (58);
de_de: Aktivieren einer der Vielzahl von Zweitachsen-Zwischenverbindungen (54) durch die primäre Zweitachsen-Zwischenverbindungsschnittstelle (58);

source: enabling another of the plurality of first-axis interconnects (52) by the secondary first-axis interconnect interface (56'); and
de_de: Aktivieren einer weiteren der Vielzahl von Erstachsen-Zwischenverbindungen (52) durch die sekundäre Erstachsen-Zwischenverbindungsschnittstelle (56'); und

source: enabling another of the plurality of second-axis interconnects (54) by the secondary second-axis interconnect interface (58').
de_de: Aktivieren einer der Vielzahl von Zweitachsen-Zwischenverbindungen (54) durch die sekundäre Zweitachsen-Zwischenverbindungsschnittstelle (58').

source: 2. The sensor array of claim 1, wherein the bypass bridge (72, 108, 148) comprises:
de_de: 2. Sensorarray nach Anspruch 1, wobei die Bypass-Brücke (72, 108, 148) umfasst:

source: an electrically-insulating substrate;
de_de: ein elektrisch isolierendes Substrat;

source: a first electrically-conductive trace, disposed on the electrically-insulating substrate;
de_de: eine erste elektrisch leitfähige Spur, die auf dem elektrisch isolierenden Substrat angeordnet ist;

source: a dielectric layer, disposed on the first conductive layer; and
de_de: eine dielektrische Schicht, die auf der ersten leitfähigen Schicht angeordnet ist; und

source: a second electrically-conductive trace, disposed on the dielectric layer, the second electrically-conductive trace being electrically isolated from the first electrically-conductive trace.
de_de: eine zweite elektrisch leitfähige Spur, die auf der dielektrischen Schicht angeordnet ist, wobei die zweite elektrisch leitfähige Spur von der ersten elektrisch leitfähigen Spur elektrisch isoliert ist.

source: 3. The sensor array of claim 1 or 2, wherein the primary and secondary first-axis interconnect interfaces (56, 56') are configured to:
de_de: 3. Sensorarray nach Anspruch 1 oder 2, wobei die primären und sekundären Erstachsen-Zwischenverbindungsschnittstellen (56, 56') ausgelegt sind zum:

source: identify a fault on one or more of the plurality of first-axis interconnects (52); and
de_de: Identifizieren eines Fehlers auf einer oder mehreren der Vielzahl von Erstachsen-Zwischenverbindungen (52); und

source: interrogate any of the plurality of sensors by enabling an associated first-axis interconnect (52) and an associated second-axis interconnect (54).
de_de: Abfragen eines beliebigen Sensors aus der Vielzahl von Sensoren durch Aktivieren einer zugehörigen Erstachsen-Zwischenverbindung (52) und einer zugehörigen Zweitachsen-Zwischenverbindung (54).

source: 4. The sensor array of any preceding claim, wherein the primary and secondary second-axis interconnect interfaces (58, 58') are configured to:
de_de: 4. Sensorarray nach einem der vorhergehenden Ansprüche, wobei die primären und sekundären Zweitachsen-Zwischenverbindungsschnittstellen (58, 58') ausgelegt sind zum:

source: identify a fault on one or more of the plurality of second-axis interconnects (54); and
de_de: Identifizieren eines Fehlers auf einer oder mehreren der Vielzahl von Zweitachsen-Zwischenverbindungen (54); und

source: 5. The sensor array of any preceding claim, wherein the interconnects (52, 54) are flexible, thereby allowing the sensor array (50, 50') to conform to a curved surface profile.
de_de: 5. Sensorarray nach einem der vorhergehenden Ansprüche, wobei die Zwischenverbindungen (52, 54) flexibel sind, wodurch es dem Sensorarray (50, 50') ermöglicht wird, sich an ein gekrümmtes Oberflächenprofil anzupassen.

source: 6. The sensor array of any preceding claim, wherein:
de_de: 6. Sensorarray nach einem der vorhergehenden Ansprüche, wobei:

source: the electrically-conductive layer comprises at least one of silver, copper, aluminum, gold, platinum, ruthenium, carbon, and/or alloys thereof; and
de_de: die elektrisch leitfähige Schicht mindestens eines der folgenden Materialien umfasst: Silber, Kupfer, Aluminium, Gold, Platin, Ruthenium, Kohlenstoff und/oder Legierungen davon; und

source: each of the dielectric layers comprises a cured base material.
de_de: jede der dielektrischen Schichten aus einem ausgehärteten Basismaterial besteht.

source: 7. The sensor array of any preceding claim, wherein each of the plurality of sensors is selected from the group consisting of a piezoelectric sensor, a resistance temperature detector (RTD), a piezoresistive sensor, a micro-electrical mechanical system (MEMS) pressure sensor, and a MEMS accelerometer.
de_de: 7. Sensorarray nach einem der vorhergehenden Ansprüche, wobei jeder der Sensoren aus der Vielzahl von Sensoren aus der Gruppe ausgewählt ist, die aus einem piezoelektrischen Sensor, einem Widerstandstemperaturdetektor (RTD), einem piezoresistiven Sensor, einem Drucksensor eines mikroelektromechanischen Systems (MEMS) und einem MEMS-Beschleunigungsmesser besteht.

source: 8. The sensor array of any preceding claim, wherein the sensor array (50') is additively-manufactured.
de_de: 8. Sensorarray nach einem der vorhergehenden Ansprüche, wobei das Sensorarray (50') additiv hergestellt ist.

source: 9. The sensor array of any preceding claim, wherein the sensor array (50') is configured to be disposed on a surface of an asset (18).
de_de: 9. Sensorarray nach einem der vorhergehenden Ansprüche, wobei das Sensorarray (50') dazu ausgelegt ist, auf einer Oberfläche eines Vermögenswerts (18) angeordnet zu werden.

source: A method of interrogating a sensor in a sensor array (50') having a lattice topology, the sensor array (50, 50') comprising a plurality of interconnects (52, 54) comprising an electrically-conductive layer sandwiched between two dielectric layers defining a plurality of first-axis interconnects (52), a plurality of second-axis interconnects (54), and a plurality of interconnect junctions, a plurality of sensor nodes (190), each disposed on an associated interconnect junction defining an associated first-axis line and second-axis line, a plurality of sensors, each disposed on an associated sensor node (190), wherein each of the plurality of sensor nodes (190) comprises a first electrode (64, 102, 142), electrically connected to an associated first-axis line, a second electrode (68, 102', 142'), electrically connected to an associated second-axis line and a bypass bridge (72, 108, 148), electrically isolating the associated second-axis line from the associated first-axis line, the array further comprising a primary and a secondary first-axis interconnect interface (56, 56') both electrically connected to the plurality of first-axis interconnects (52), and a primary and a secondary second-axis interconnect interface (58), both electrically connected to the plurality of second-axis interconnects (54), the method comprising performing the steps of interrogating two of the plurality of sensors at the same time by simultaneously:
de_de: Ein Verfahren zum Abfragen eines Sensors in einem Sensorarray (50') mit einer Gittertopologie, wobei das Sensorarray (50, 50') umfasst: eine Vielzahl von Zwischenverbindungen (52, 54), die eine elektrisch leitfähige Schicht zwischen zwei dielektrischen Schichten umfassen, die eine Vielzahl von Erstachsen-Zwischenverbindungen (52), eine Vielzahl von Zweitachsen-Zwischenverbindungen (54) und eine Vielzahl von Zwischenverbindungsstellen definieren, eine Vielzahl von Sensorknoten (190), die jeweils an einer zugehörigen Zwischenverbindungsstelle angeordnet sind, die eine zugehörige Erstachsenleitung und eine Zweitachsenleitung definiert, eine Vielzahl von Sensoren, die jeweils an einem zugehörigen Sensorknoten (190) angeordnet sind, wobei jeder der Sensorknoten der Vielzahl von Sensorknoten (190) eine erste Elektrode (64, 102, 142), die elektrisch mit einer zugehörigen Erstachsenleitung verbunden ist, eine zweite Elektrode (68, 102', 142'), die elektrisch mit einer zugehörigen Zweitachsenleitung verbunden ist, und eine Bypass-Brücke (72, 108, 148) umfasst, die die zugehörige Zweitachsenleitung elektrisch von der zugehörigen Erstachsenleitung isoliert, wobei das Array außerdem umfasst: eine primäre und eine sekundäre Erstachsen-Zwischenverbindungsschnittstelle (56, 56'), die beide elektrisch mit der Vielzahl von Erstachsen-Zwischenverbindungen (52) verbunden sind, sowie eine primäre und eine sekundäre Zweitachsen-Zwischenverbindungsschnittstelle (58), die beide elektrisch mit der Vielzahl von Zweitachsen-Zwischenverbindungen (54) verbunden sind, wobei das Verfahren das Ausführen der Schritte des gleichzeitigen Abfragens von zwei Sensoren der Vielzahl von Sensoren umfasst, durch gleichzeitiges:

source: (a) enabling, with the primary first-axis interconnect interface (56), one of the plurality of first-axis interconnects (52);
de_de: (a) Aktivieren einer der Vielzahl von Erstachsen-Zwischenverbindungen (52) durch die primäre Erstachsen-Zwischenverbindungsschnittstelle (56);

source: (b) enabling, with the secondary first-axis interconnect interface (56') electrically connected to the plurality of first-axis interconnects (52), another of the plurality of first-axis interconnects (52);
de_de: (b) Aktivieren einer weiteren der Vielzahl von Erstachsen-Zwischenverbindungen (52), wobei die sekundäre Erstachsen-Zwischenverbindungsschnittstelle (56') elektrisch mit der Vielzahl von Erstachsen-Zwischenverbindungen (52) verbunden ist;

source: (c) enabling, with the primary second-axis interconnect interface (58), one of the plurality of second-axis interconnects (54);
de_de: (c) Aktivieren einer der Vielzahl von Zweitachsen-Zwischenverbindungen (54) durch die primäre Zweitachsen-Zwischenverbindungsschnittstelle (58);

source: (d) enabling, with the secondary second-axis interconnect interface (58') electrically connected to the plurality of second-axis interconnects (54), another of the plurality of second-axis interconnects (54); and
de_de: (d) Aktivieren einer weiteren der Vielzahl von Zweitachsen-Zwischenverbindungen (54), wobei die sekundäre Zweitachsen-Zwischenverbindungsschnittstelle (58') elektrisch mit den mehreren Zweitachsen-Zwischenverbindungen (54) verbunden ist; und

source: (e) interrogating two of the plurality of sensors corresponding to the enabled primary and secondary first-axis interconnect (52) and the enabled primary and secondary second-axis interconnect (54).
de_de: (e) Abfragen von zwei Sensoren der Vielzahl von Sensoren, die der aktivierten primären und sekundären Erstachsen-Zwischenverbindung (52) und der aktivierten primären und sekundären Zweitachsen-Zwischenverbindung (54) entsprechen.

source: The method of claim 10, wherein each of the plurality of sensor nodes (190) comprises:
de_de: Verfahren nach Anspruch 10, wobei jeder der Sensorknoten der Vielzahl von Sensorknoten (190) umfasst:

source: a second electrode (68, 102', 142'), electrically connected to associated second-axis line; and
de_de: eine zweite Elektrode (68, 102', 142'), die elektrisch mit einer zugehörigen Zweitachsenleitung verbunden ist; und

source: a bypass bridge (72, 108, 148), electrically isolating the associated second-axis line from the associated first-axis line.
de_de: eine Bypass-Brücke (72, 108, 148), die die zugehörige Zweitachsenleitung von der zugehörigen Erstachsenleitung elektrisch isoliert.

source: The method of claim 11, wherein the bypass bridge (72, 108, 148) comprises:
de_de: Verfahren nach Anspruch 11, wobei die Bypass-Brücke (72, 108, 148) umfasst:
